# Домашнее задание 1 к уроку 2. Посмитный Андрей Группа: GU_DS-med_1773
# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно,
# в программе.

spel = ['Hello', 123, 45.8, True, None]

for i in spel:
    print(type(i))
