#4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.

r = input('Введите многозначное число:     ')

spel =[]

spel.append(r)

print(max(r))
